# BadProblemWithGroup Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..BadProblemWithGroup Property
BuiltInFailures..::..GroupFailures Class See Also
---
The operation performed affects groups in an unacceptable manner.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BadProblemWithGroup { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BadProblemWithGroup As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BadProblemWithGroup {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace